
const RulesPage = () => {
  return (
        <div className="min-h-screen flex items-center justify-center bg-white font-sans p-6">
      <div className="max-w-3xl w-full text-center space-y-6">
        {/* العنوان */}
        <h2 className="text-[#085E9C] text-xl font-bold">شروط الاستخدام  </h2>

         <div className="border rounded-md p-6 text-gray-800 leading-loose text-right text-sm">
لغرض جودة الخدمة وسرعة الانجاز فأننا من الممكن مشاركة معلوماتك الشخصية وبيانات حجزك مع جميع فروعنا وخدمة العملاء ومع شركائنا (المضيفين) للتنسيق والتواصل معك إن دعت الحاجة لذلك. من الممكن أيضاً مشاركة بيانات التواصل الخاصة بك من بريد إلكتروني وجوال مع جهات أخرى جديرة بالثقة مثل الفنادق، ومع ذلك فإننا نضمن لك في مكان عدم مشاركة معلوماتك الشخصية لأي جهات ترويجية لغرض التسويق إلا بعد اخذ الموافقة المسبقة منك. أيضا، يحق لك طلب مشاركة معلوماتك مع طرف ثالث إن أمكن. في حال الحاجة ومن جهات عليا فقط مثل الجهات الأمنية قد نضطر إلى مشاركة بياناتك مثل بيانات الحجز والتاريخ وساعات الوصول والمغادرة والمبالغ التي تمت بوسائل الدفع الإلكتروني في منصاتنا. بمجرد تقديم معلوماتك الشخصية واستخدامك لمنصتنا (الموقع والتطبيقات) من عمل حجوزات وارسال مدفوعات فأنك توافق على مشاركة تلك البيانات في نظام شموس الأمني.

        </div>

        <button className="border w-[40%] border-[#085E9C] text-[#085E9C] px-8 py-2 rounded hover:bg-blue-50 transition">
          إغلاق
        </button>
      </div>
    </div>
  )
}

export default RulesPage
